-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2016-11-01 17:57:31
-- 伺服器版本: 10.1.16-MariaDB
-- PHP 版本： 5.6.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fwie`
--

-- --------------------------------------------------------

--
-- 資料表結構 `airquality_station`
--

CREATE TABLE `airquality_station` (
  `id` int(3) NOT NULL COMMENT '序號',
  `City` varchar(3) DEFAULT NULL COMMENT '縣市',
  `County` varchar(4) DEFAULT NULL COMMENT '鄉鎮市區',
  `st_name` varchar(4) DEFAULT NULL COMMENT '測站名稱',
  `st_addr` varchar(18) DEFAULT NULL COMMENT '測站地址',
  `AR_ar` varchar(6) DEFAULT NULL COMMENT '空品區',
  `GPS_Longitude` double DEFAULT NULL COMMENT '經度',
  `GPS_Latitude` double DEFAULT NULL COMMENT '緯度',
  `img` varchar(39) DEFAULT NULL COMMENT '影像連結'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `airquality_station`
--

INSERT INTO `airquality_station` (`id`, `City`, `County`, `st_name`, `st_addr`, `AR_ar`, `GPS_Longitude`, `GPS_Latitude`, `img`) VALUES
(1, '臺北市', '北投區', '陽明', '臺北市北投區竹子湖路１１１號', '北部空品區', 121.529583, 25.182722, '[URL]/ATM/AQX_P_01/064-201611011830.jpg'),
(2, '臺北市', '萬華區', '萬華', '臺北市萬華區中華路一段６６號', '北部空品區', 121.507972, 25.046503, '[URL]/ATM/AQX_P_01/013-201611011840.jpg'),
(3, '臺北市', '大同區', '大同', '臺北市大同區重慶北路三段２號', '北部空品區', 121.513311, 25.0632, ''),
(4, '臺北市', '中山區', '中山', '臺北市中山區林森北路５１１號', '北部空品區', 121.526528, 25.062361, ''),
(5, '臺北市', '大安區', '古亭', '臺北市大安區羅斯福路三段１５３號', '北部空品區', 121.529556, 25.020608, ''),
(6, '臺北市', '松山區', '松山', '臺北市松山區八德路四段７４６號', '北部空品區', 121.578611, 25.05, ''),
(7, '臺北市', '北投區', '士林', '臺北市北投區文林北路１５５號', '北部空品區', 121.515389, 25.105417, ''),
(8, '新北市', '土城區', '土城', '新北市土城區學府路一段２４１號', '北部空品區', 121.451861, 24.982528, ''),
(9, '新北市', '林口區', '林口', '新北市林口區民治路２５號', '北部空品區', 121.376869, 25.077197, ''),
(10, '新北市', '萬里區', '萬里', '新北市萬里區瑪鋉路２２１號', '北部空品區', 121.689881, 25.179667, ''),
(11, '新北市', '汐止區', '汐止', '新北市汐止區樟樹一路１４１巷２號', '北部空品區', 121.6423, 25.067131, ''),
(12, '新北市', '淡水區', '淡水', '新北市淡水區中正東路４２巷６號', '北部空品區', 121.449239, 25.1645, ''),
(13, '新北市', '新店區', '新店', '新北市新店區民族路１０８號', '北部空品區', 121.537778, 24.977222, ''),
(14, '新北市', '新莊區', '新莊', '新北市新莊區中正路５１０號', '北部空品區', 121.4325, 25.037972, ''),
(15, '新北市', '永和區', '永和', '新北市永和區永和路光復路交口', '北部空品區', 121.516306, 25.017, ''),
(16, '新北市', '三重區', '三重', '新北市三重區三和路重陽路交口', '北部空品區', 121.493806, 25.072611, ''),
(17, '新北市', '板橋區', '板橋', '新北市板橋區文化路一段２５號', '北部空品區', 121.458667, 25.012972, ''),
(18, '新北市', '三重區', '菜寮', '新北市三重區中正北路１６３號', '北部空品區', 121.481028, 25.06895, ''),
(19, '臺中市', '西屯區', '西屯', '臺中市西屯區安和路１號', '中部空品區', 120.616917, 24.162197, '[URL]/ATM/AQX_P_01/032-201611011840.jpg'),
(20, '臺中市', '南屯區', '忠明', '臺中市南屯區公益路二段２９６號', '中部空品區', 120.641092, 24.151958, ''),
(21, '臺中市', '豐原區', '豐原', '臺中市豐原區水源路１５０號', '中部空品區', 120.741711, 24.256586, ''),
(22, '臺中市', '沙鹿區', '沙鹿', '臺中市沙鹿區英才路１５０號', '中部空品區', 120.568794, 24.225628, ''),
(23, '臺中市', '大里區', '大里', '臺中市大里區大新街３６號', '中部空品區', 120.677689, 24.099611, ''),
(24, '臺南市', '新營區', '新營', '臺南市新營區中正路４號', '雲嘉南空品區', 120.31725, 23.305633, ''),
(25, '臺南市', '善化區', '善化', '臺南市善化區益名寮６０號', '雲嘉南空品區', 120.297142, 23.115097, ''),
(26, '臺南市', '安南區', '安南', '臺南市安南區安和路三段１９３號', '雲嘉南空品區', 120.2175, 23.048197, ''),
(27, '臺南市', '中西區', '臺南', '臺南市中西區南寧街４５號', '雲嘉南空品區', 120.202617, 22.984581, ''),
(28, '高雄市', '左營區', '左營', '高雄市左營區翠華路６８７號', '高屏空品區', 120.292917, 22.674861, ''),
(29, '高雄市', '楠梓區', '楠梓', '高雄市楠梓區楠梓路２６２號', '高屏空品區', 120.328289, 22.733667, ''),
(30, '高雄市', '前金區', '前金', '高雄市前金區河南二路１９６號', '高屏空品區', 120.288086, 22.632567, ''),
(31, '高雄市', '前鎮區', '復興', '高雄市前鎮區民權二路３３１號', '高屏空品區', 120.312017, 22.608711, ''),
(32, '高雄市', '前鎮區', '前鎮', '高雄市前鎮區中山三路４３號', '高屏空品區', 120.307564, 22.605386, ''),
(33, '高雄市', '小港區', '小港', '高雄市小港區平和南路１８５號', '高屏空品區', 120.337736, 22.565833, ''),
(34, '高雄市', '鳳山區', '鳳山', '高雄市鳳山區曹公路６號', '高屏空品區', 120.358083, 22.627392, ''),
(35, '高雄市', '林園區', '林園', '高雄市林園區北汕路５８巷２號', '高屏空品區', 120.41175, 22.4795, '[URL]/ATM/AQX_P_01/052-201611011840.jpg'),
(36, '高雄市', '大寮區', '大寮', '高雄市大寮區潮寮路６１號', '高屏空品區', 120.425081, 22.565747, ''),
(37, '高雄市', '仁武區', '仁武', '高雄市仁武區八卦里永仁街５５５號', '高屏空品區', 120.332631, 22.689056, '[URL]/ATM/AQX_P_01/049-201611011840.jpg'),
(38, '高雄市', '橋頭區', '橋頭', '高雄市橋頭區隆豐北路１號', '高屏空品區', 120.305689, 22.757506, ''),
(39, '高雄市', '美濃區', '美濃', '高雄市美濃區中壇里忠孝路１９號', '高屏空品區', 120.530542, 22.883583, ''),
(40, '基隆市', '信義區', '基隆', '基隆市東信路３２４號', '北部空品區', 121.760056, 25.129167, ''),
(41, '新竹市', '東區', '新竹', '新竹市民族路３３號', '竹苗空品區', 120.972075, 24.805619, ''),
(42, '嘉義市', '西區', '嘉義', '嘉義市西區新民路５８０號', '雲嘉南空品區', 120.440833, 23.462778, '[URL]/ATM/AQX_P_01/042-201611011840.jpg'),
(43, '宜蘭縣', '冬山鄉', '冬山', '宜蘭縣冬山鄉南興村照安路２６號', '宜蘭空品區', 121.792928, 24.632203, ''),
(44, '宜蘭縣', '宜蘭市', '宜蘭', '宜蘭縣宜蘭市復興路二段７７號', '宜蘭空品區', 121.746394, 24.747917, '[URL]/ATM/AQX_P_01/065-201611011840.jpg'),
(45, '桃園市', '桃園區', '桃園', '桃園市桃園區成功路二段１４４號', '北部空品區', 121.319964, 24.994789, ''),
(46, '桃園市', '大園區', '大園', '桃園市大園區中正東路１６０號', '北部空品區', 121.201811, 25.060344, ''),
(47, '桃園市', '觀音區', '觀音', '桃園市觀音區文化路２號', '北部空品區', 121.082761, 25.035503, ''),
(48, '桃園市', '龍潭區', '龍潭', '桃園市龍潭區中正路２１０號', '北部空品區', 121.21635, 24.863869, ''),
(49, '桃園市', '中壢區', '中壢', '桃園市中壢區延平路６２２號', '北部空品區', 121.221667, 24.953278, ''),
(50, '桃園市', '平鎮區', '平鎮', '桃園市平鎮區文化街１８９號', '北部空品區', 121.203986, 24.952786, ''),
(51, '新竹縣', '竹東鎮', '竹東', '新竹縣竹東鎮榮樂里三民街７０號', '竹苗空品區', 121.088903, 24.740644, ''),
(52, '新竹縣', '湖口鄉', '湖口', '新竹縣湖口鄉成功路３６０號', '竹苗空品區', 121.038653, 24.900142, ''),
(53, '苗栗縣', '三義鄉', '三義', '苗栗縣三義鄉西湖村上湖６１-１號', '竹苗空品區', 120.758833, 24.382942, ''),
(54, '苗栗縣', '苗栗市', '苗栗', '苗栗市縣府路１００號', '竹苗空品區', 120.8202, 24.565269, ''),
(55, '苗栗縣', '頭份市', '頭份', '苗栗縣頭份鎮文化街２０號', '竹苗空品區', 120.898572, 24.696969, ''),
(56, '彰化縣', '線西鄉', '線西', '彰化縣線西鄉寓埔村中央路二段１４５號', '中部空品區', 120.469061, 24.131672, ''),
(57, '彰化縣', '彰化市', '彰化', '彰化縣彰化市文心街５５號', '中部空品區', 120.541519, 24.066, ''),
(58, '彰化縣', '二林鎮', '二林', '彰化縣二林鎮萬合里江山巷１號', '中部空品區', 120.409653, 23.925175, ''),
(59, '南投縣', '埔里鎮', '埔里', '南投縣埔里鎮西安路一段１９３號', '中部空品區', 120.967903, 23.968842, '[URL]/ATM/AQX_P_01/072-201611011840.jpg'),
(60, '南投縣', '南投市', '南投', '南投市南陽路２６９號', '中部空品區', 120.685306, 23.913, ''),
(61, '南投縣', '竹山鎮', '竹山', '南投縣竹山鎮大明路６６６號', '中部空品區', 120.677306, 23.756389, ''),
(62, '雲林縣', '麥寮鄉', '麥寮', '雲林縣麥寮鄉中興路１１５號', '雲嘉南空品區', 120.251825, 23.753506, '[URL]/ATM/AQX_P_01/083-201611011840.jpg'),
(63, '雲林縣', '臺西鄉', '臺西', '雲林縣臺西鄉五港路５０５號', '雲嘉南空品區', 120.202842, 23.717533, '[URL]/ATM/AQX_P_01/041-201611011830.jpg'),
(64, '雲林縣', '崙背鄉', '崙背', '雲林縣崙背鄉南陽村大成路９１號', '雲嘉南空品區', 120.348742, 23.757547, '[URL]/ATM/AQX_P_01/038-201611011840.jpg'),
(65, '雲林縣', '斗六市', '斗六', '雲林縣斗六市民生路２２４號', '雲嘉南空品區', 120.544994, 23.711853, '[URL]/ATM/AQX_P_01/037-201611011840.jpg'),
(66, '嘉義縣', '新港鄉', '新港', '嘉義縣新港鄉登雲路１０５號', '雲嘉南空品區', 120.345531, 23.554839, ''),
(67, '嘉義縣', '朴子市', '朴子', '嘉義縣朴子市光復路３４號', '雲嘉南空品區', 120.24735, 23.465308, ''),
(68, '屏東縣', '恆春鎮', '恆春', '屏東縣恆春鎮公園路４４號', '高屏空品區', 120.788928, 21.958069, ''),
(69, '屏東縣', '屏東市', '屏東', '屏東市蘇州街７５號', '高屏空品區', 120.488033, 22.673081, ''),
(70, '屏東縣', '潮州鎮', '潮州', '屏東縣潮州鎮九塊里復興路６６號', '高屏空品區', 120.561175, 22.523108, ''),
(71, '臺東縣', '臺東市', '臺東', '臺東市中山路２７６號', '花東空品區', 121.15045, 22.755358, '[URL]/ATM/AQX_P_01/062-201611011840.jpg'),
(72, '臺東縣', '關山鎮', '關山', '臺東縣關山鎮自強路６６號', '花東空品區', 121.161933, 23.045083, ''),
(73, '花蓮縣', '花蓮市', '花蓮', '花蓮市中正路２１０號', '花東空品區', 121.599769, 23.971306, ''),
(74, '澎湖縣', '馬公市', '馬公', '澎湖縣馬公市中正路１１５號', '其他', 119.566158, 23.569031, ''),
(75, '金門縣', '金城鎮', '金門', '金門縣金城鎮民權路３２號', '其他', 118.312256, 24.432133, '[URL]/ATM/AQX_P_01/077-201611011730.jpg'),
(76, '連江縣', '南竿鄉', '馬祖', '連江縣南竿鄉介壽村１３號', '其他', 119.949875, 26.160469, '[URL]/ATM/AQX_P_01/075-201611011830.jpg');

-- --------------------------------------------------------

--
-- 資料表結構 `weather_station`
--

CREATE TABLE `weather_station` (
  `ID` int(4) NOT NULL,
  `StationName` varchar(10) DEFAULT NULL,
  `GPS_Longitude` double DEFAULT NULL,
  `GPS_Latitude` double DEFAULT NULL,
  `Address` varchar(40) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `weather_station`
--

INSERT INTO `weather_station` (`ID`, `StationName`, `GPS_Longitude`, `GPS_Latitude`, `Address`) VALUES
(1, '鞍部', 121.52, 25.186, '北投區陽明山竹子湖路111號'),
(2, '臺中', 120.675, 24.147, '北區精武路295號'),
(3, '阿里山', 120.804, 23.51, '阿里山鄉中正村4鄰東阿里山73-1號'),
(4, '蘭嶼', 121.55, 22.038, '蘭嶼鄉紅頭村2號'),
(5, '梧棲', 120.515, 24.258, '梧棲區臺灣大道十段2號海港大樓6樓'),
(6, '花蓮', 121.604, 23.976, '花蓮市花崗街24號'),
(7, '基隆', 121.732, 25.134, '仁愛區港西街6號6樓(海港大樓6樓)'),
(8, '日月潭', 120.908, 23.881, '魚池鄉水社村中山路270巷14號'),
(9, '板橋', 121.433, 24.999, '板橋區大觀路二段265巷62號'),
(10, '玉山', 120.951, 23.489, '信義鄉東埔村1鄰玉山北峰1號'),
(11, '淡水', 121.44, 25.165, '淡水區中正東路42巷6號'),
(12, '嘉義', 120.424, 23.497, '北新里海口寮路56號'),
(13, '東吉島', 119.659, 23.258, '望安鄉東吉村156號'),
(14, '臺北', 121.506, 25.04, '中正區公園路64號'),
(15, '澎湖', 119.555, 23.567, '馬公市新興路2號'),
(16, '新屋', 121.047, 25.006, '新屋鄉東興路二段946號'),
(17, '高雄', 120.308, 22.567, '前鎮區明孝里26鄰漁港南二路2號'),
(18, '金門', 118.289, 24.407, '金城鎮金水里西海路一段250號'),
(19, '恆春', 120.738, 22.005, '恆春鎮天文路50號'),
(20, '彭佳嶼', 122.071, 25.629, '中正區彭佳嶼'),
(21, '竹子湖', 121.536, 25.165, '北投區陽明山竹子湖路2號'),
(22, '新竹', 121.006, 24.83, '竹北市光明五街60號'),
(23, '臺東', 121.146, 22.754, '臺東市大同路106號'),
(24, '大武', 120.895, 22.357, '大武鄉大武街115號'),
(25, '宜蘭', 121.748, 24.765, '宜蘭市力行街3號'),
(26, '馬祖', 119.923, 26.169, '南竿鄉四維村6鄰88號'),
(27, '臺南', 120.204, 22.993, '中西區公園路21號'),
(28, '蘇澳', 121.86, 24.601, '蘇澳鎮港區路1號6樓(蘇澳港行政大樓6樓)'),
(29, '成功', 121.365, 23.099, '成功鎮公民路84號');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `airquality_station`
--
ALTER TABLE `airquality_station`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `weather_station`
--
ALTER TABLE `weather_station`
  ADD PRIMARY KEY (`ID`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
